system/funkySetFieldsDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


expressions (
U
   {
       field U;
//       expression "vector (1.5*(1-sqr(pos().y-1))+1*(2*rand(1)-1), 1*(2*rand(2)-1), 1*(2*rand(3)-1))";
//       expression "vector ( 1.5 * ( 1 - sqr ( pos().y - 1 ) ) + 1 * ( 2 * rand(1) - 1 ) , 0 , 0 )" ;
//       expression "vector ( 1.5 * ( 1 - sqr ( pos().y - 1 ) ) , 0 , 0 )" ;
       expression "vector ( 1.5 * ( 1 - sqr ( pos().y ) + (2 * rand(1) ) ) , 0 , 0 )" ;
       keepPatches 1;
   }

);

